package semiPljec.user;

public enum Menu {

    
    /*
    * 한식:김치,비빔밥,불고기,한정식
    * 중식:딤섬,마파두부,훠궈,마라탕,짜장면,짬뽕
    * 일식:스시,라멘,덴푸라
    * 동남아-태국:똠얌꿍,팟타이,그린커리
    * 동남아-베트남:쌀국수,반미,분짜
    * 동남아-인도네시아:나시고렝,사테
    * 동남아-필리핀:아도보,레촌
    * 인도/남아시아:카레,탄두리,사모사,난
    * 중동-터키:케밥,바클라바,피데
    * 중동-레바논:후무스,타불레
    * 중동-이란:케밥,체로스코르트(스튜)
    * 유럽-이탈리아:피자,파스타,리조또
    * 유럽-프랑스:크루아상,와인,치즈,에스카르고
    * 유럽-스페인:빠에야,타파스,감바스
    * 유럽-독일:소시지,슈니첼,프레첼
    * 유럽-영국:피시앤칩스,로스트비프,애프터눈티
    * 아메리카-북미-미국:햄버거,바비큐,치즈케이크
    * 아메리카-북미-캐나다:메이플 시럽 요리
    * 아메리카-중남미-멕시코:타코,부리토,나초
    * 아메리카-중남미-브라질:슈하스코(바비큐),아사이볼
    * 아메리카-중남미-아르헨티나:스테이크,엠파나다
    * 아메리카-중남미-페루:세비체,로모 살타도
    * 오세아니아-호주:미트파이,라미네이션(케이크)
    * 오세아니아-뉴질랜드:파블로바(디저트),허니 램
    *
    * 조리법, 조리도구 기준
    * 구이류(그릴,로스터,비비큐):바비큐,불고기,케밥,스테이크
    * 튀김류(프라이):치킨, 돈카츠, 템푸라, 감자튀김
    * 찜류(스팀/보일):만두,딤섬,찜닭,갈비찜
    * 볶음류:볶음밥,팟타이,짜장면
    * 국,탕,스프류:된장찌개,똠얌꿍,보르시치
    * 빵,면,곡물류:파스타,라멘,쌀밥,빵
    *
    *식재료기준
    * 육류:스테이크,삼겹살,슈바인학센
    * 해산물:스시,세비체,랍스터구이
    * 채식:샐러드,비건버거,두부요리
    * 곡물/밀가루:파스타,빵,국수,피자
    * 유제품 중심:치즈플래터,퐁듀,요거트
    *
    * 식문화/종교기준
    * 비건/베지테리언:고기,동물성 재료 배제
    * 할랄:이슬람 율법에 맞춘 조리
    * 코셔:유대교 식법 준수
    * 오가닉/클린푸드:자연식,무첨가
    *
    * 식사형태기준
    * 단품:햄버거,스테이크,비빔밥
    * 코스:프렌치디너,한정식
    * 길거리음식:떡볶이,핫도그,타코
    * 패스트푸드:치킨,피자,버거
    * 가정식:백반,미트로프,카레라이스
    *
    * */
}
